[
  {
    "DOI": "10.1038/s44306-025-00103-1",
    "title": "Orbitronics in two-dimensional materials",
    "link": "http://dx.doi.org/10.1038/s44306-025-00103-1",
    "notes": null,
    "text": "Abstract\nOrbitronics explores the control and manipulation of electronic orbital angular momentum in solid-state systems, opening new pathways for information processing and storage. One significant advantage of orbitronics over spintronics is that it does not rely on spin-orbit coupling, thereby broadening the range of non-magnetic materials that can be utilized for these applications. It also introduces new topological features related to electronic orbital angular momentum, and clarifies some long-standing challenges in understanding experiments that rely on the conventional concept of valley transport. This review highlights recent advances in orbitronics, particularly in relation to two-dimensional materials. We examine the fundamental principles underlying the generation, transport, and dynamics of orbital angular momentum to illustrate how the unique properties of two-dimensional materials can promote orbitronic phenomena. We also outline potential future research directions and address some outstanding questions in this field.\nSimilar content being viewed by others\nIntroduction\nThe control of current flow by manipulating the spin degrees of freedom has led to the emergence of spintronics. Significant advances in this field over the past few decades1,2,3,4 have provided innovative solutions to enhance the diversity, functionality, and efficiency of devices used for information processing and storage.\nSpin current is a key concept in the field of spintronics. The generation of pure spin current in time-reversal symmetric systems requires the presence of spin-orbit coupling (SOC). This relativistic interaction, given by λŜ·L̂, couples the electronic spin operator Ŝ with the orbital angular momentum (OAM) operator L̂. Its intensity λ is material dependent and increases rapidly with the atomic number Z of the constituent elements. A prominent spintronic phenomenon is the spin Hall effect (SHE), in which a transverse spin current is generated in response to a longitudinal applied electric field5,6,7. In addition to producing pure spin currents for practical applications in spintronic devices, the SHE may serve as a reliable identifier of the quantum spin Hall insulating phase. This topological phase of matter has spurred a considerable amount of research activity in condensed matter physics over the past two decades8,9,10. However, the need for a strong SOC may greatly limit the options for material selection. For instance, the relatively low atomic number of carbon presents a challenge to manipulating the electronic spin in pristine graphene. To address this limitation, one possible approach involves doping graphene with impurities that exhibit high SOC values, or placing it sufficiently close to materials that can induce SOC in graphene through the proximity effect, in order to improve its potential application in spintronics4,11. Similar limitations occur in other materials composed of elements with low atomic numbers12. However, materials with naturally high SOC are relatively rare, and their extraction processes often incur significant environmental and economic costs13.\nIt is worth noting that an electric field does not interact directly with the electronic spin but couples to the charge carriers and may affect their orbital angular momenta. This perturbation can propagate through the system, generating an OAM current that does not require the presence of SOC and is not necessarily accompanied by a charge current. The use of electronic OAM degrees of freedom for information processing and storage has given rise to the field of orbitronics, which has been evolving very rapidly in recent years.\nOrbitronics shares similarities with spintronics. Several key spintronic effects, including the SHE, the inverse spin Hall effect (ISHE), the spin Rashba-Edelstein effect (SREE), and spin pumping, among others, have corresponding orbitronic analogs14,15,16. The ability to generate OAM currents without relying on spin-orbit interaction significantly broadens the range of materials that can be employed in orbitronic applications. For example, the orbital Hall effect (OHE), which describes the emergence of a transverse OAM current in response to a longitudinally applied electric field, was originally predicted to occur in p-doped silicon, a material characterized by weak SOC 17. For several years, few theoretical works explored the OHE foreseen by Bernevig, Hughes, and Zhang. Most of them focused on three-dimensional metallic materials18,19,20,21,22, with a single exception that examined OHE in graphane23. Initially, some of the challenges in the field of orbitronics stemmed from experimental difficulties in unambiguously identifying the accumulation and transport of OAM. On the theoretical side, the definition of OAM in periodic systems also presented significant hurdles24,25,26. For some time, there was also a certain skepticism regarding the importance of orbital effects compared to spin effects. In part, because of a prevalent belief that OAM quenching would render orbital physics less significant. However, this perception has changed significantly in recent years due to theoretical and experimental advances in the field of orbitronics27,28,29,30. In fact, it took almost two decades, since its theoretical prediction, for the first direct observation of OHE to be announced in titanium31. Additional studies on other low-SOC materials followed32,33 and more recently, OHE has also been reported in silicon34, which was the material proposed in 2005 to exhibit this effect17.\nThe OHE enables the generation of OAM currents in non-magnetic systems, paving the way for the development of orbitronic devices. Conversely, inverse OHE can be utilized to detect these currents in certain materials. Other non-equilibrium orbitronic effects play a crucial role in manipulating electronic OAM. Notable examples include orbital torque (OT) effects35,36,37,38,39,40 and orbital Rashba-Edelstein effect (OREE)41,42,43,44, also called orbital magnetoelectric effect. Along with their corresponding inverse phenomena linked to the Onsager reciprocity relations, they have introduced novel methods for manipulating orbital and spin angular momenta in nanostructures.\nAlthough much of the research in orbitronics has focused on metallic three-dimensional systems, there is increasing interest in two-dimensional (2D) materials. The reduction in dimensionality significantly alters the crystalline field experienced by electrons in 2D materials compared to the bulk. This change affects orbital hybridizations, which can have a profound impact on orbital and electronic properties. For example, thin films of transition metal dichalcogenides (TMDs), with stoichiometry MX2, where M represents a transition metal atom and X denotes a chalcogen atom, exhibit electronic properties that depend on their composition, crystalline stacking, and thickness. Interestingly, these materials exhibit sizable orbital Hall conductivity plateaus within their semiconducting gaps, where the spin Hall conductivity vanishes45,46,47. The H structural phase of MoS2 is actually an orbital Hall insulator, characterized by an orbital Chern number C_L_z, which takes the value of one for the monolayer and two for the bilayer48,49. Furthermore, TMD monolayers in their 2H and 1T structural phases have also been classified as higher-order topological insulators (HOTI) and they all display a plateau in orbital Hall conductivity within the band gap47,50,51.\n2D materials represent an exciting platform for research in orbitronics, particularly those of the van der Waals type. They can be exfoliated to produce ultrathin films down to monolayer thickness, which can be easily placed onto various substrates to create heterostructures with unique orbitronic features52,53,54,55,56,57.\nThis review highlights significant advances in the orbitronics of 2D materials. Section \"Theoretical background\", provides an overview of some basic concepts underlying orbitronic effects. In Section \"OAM in 2D Materials\", we discuss observations of orbital textures and some theoretical formulations of the OAM operator, emphasizing their use in two-dimensional materials. Section \"OHE in 2D Materials\", brings attention to progress related to the OHE in two-dimensional materials. In Section \"Controlling OAM\", we provide an overview of the current landscape of the OREE, and orbital torques (OT), as explored by researchers in the field of two-dimensional materials. Section \"Effects of Disorder\", explores the consequences of disturbances caused by impurities and defects, with a particular emphasis on orbital relaxation processes and extrinsic contributions to the OHE and OREE. In the concluding section, we provide our insights into potential future research directions for orbitronics in 2D materials.\nTheoretical background\nOrbital Hall effect\nThe first proposal for the OHE was presented by Bernevig et al.17. In their seminal work, they introduced it as an effect analogous to the SHE, but centered on the transport of OAM. Later, Go et al. in ref. 28 proposed a microscopic mechanism that explains how OAM can be transported even in non-magnetic and centrosymmetric systems. In these systems, while equilibrium OAM is quenched, an external electric field induces a non-equilibrium OAM texture, leading to a transverse orbital current. Within linear response theory, the OHE can be mathematically expressed as:\nwhere 𝒥_y^L_z represents the current density component along the ŷ direction of the OAM component Lz, induced by an electric field with intensity ℰ_x applied in the x̂ direction.\nFigure 1 shows a schematic representation of the OHE and the resulting accumulation of OAM at the edges of a 2D system due to the transverse orbital current. It is worth mentioning that the orbital current is a quantum mechanical expectation value of the OAM flux carried by the conduction electrons; it does not represent a transverse flow of charge carriers. Rather, it describes how electrons, while moving longitudinally under an electric field, acquire OAM, resulting in a net angular momentum flow without any accompanying net charge transport in the transverse direction.\nThis effect can occur in the absence of SOC as well as in the presence of spatial inversion and time-reversal symmetry. Within the picture of the mechanism introduced in ref. 28, SOC partially transfers the transverse orbital current to the spin sector [σ_yx^L_z→σ_yx^S_z], giving rise to SHE as a secondary phenomenon resulting from the more fundamental OHE. Other theoretical aspects of the OHE are detailed in recent reviews14,15,16.\nOne may generalize equation (1) to include other matrix elements of the orbital conductivity tensor σ_μ ,ν^L_δ. This tensor obeys the same symmetry properties as the spin conductivity tensor58,59. However, the physical picture elaborated in ref. 28 applies to the elements of Eq. (1) and its cyclic permutations in the Cartesian indices x, y and z.\nThe current density operator is defined by,\nwhere v̂ and L̂_z represent the electronic velocity and z-component of the OAM operators, respectively.\nFor 2D systems, the orbital Hall conductivity (OHC) σ_yx^L_z can be expressed as\nwhere the orbital Berry curvature is\nHere, the components α = x, y of the velocity operators may be obtained by v̂_α(k)=ℏ^-1∂Ĥ_k/∂k_α, f(ε) denotes the usual Fermi-Dirac distribution function and |u_nk⟩ is the cell-periodic part of the Bloch states with eigenvalue εnk. Figure 2 illustrates the valence-band orbital Berry curvature for a monolayer of 2H-TMD, a prototypical multi-orbital Dirac material discussed in this review. In solids, the Berry curvature plays a role analogous to a magnetic field in momentum space, encoding how electronic wavefunctions twist or acquire geometric phase as the crystal momentum changes60,61. The orbital Berry curvature refines this concept by taking into account the orbital character of the wavefunctions-effectively weighting the conventional Berry curvature by the expectation value of the OAM operator28. It captures how electrons with specific orbital identities respond to external fields, and directly contributes to orbital transport phenomena such as the OHE. While the conventional Berry curvature of monolayer 2H-TMD valence bands has opposite signs at the K and K^' valleys-leading to effects like the valley Hall effect-the orbital Berry curvature, as shown in Fig. 2d, has the same sign at both valleys. This distinction is crucial, as it gives rise to a net orbital Hall conductivity even in centrosymmetric systems that preserve time-reversal symmetry48,49, and is responsible for the emergence of the orbital Hall insulating phase discussed in later sections45.\nOrbital Rashba Edelstein effect\nThe OREE refers to the generation of orbital magnetization induced by an electric current. It is a Fermi-surface phenomenon that can occur in non-magnetic systems but requires the breaking of spatial-inversion symmetry62. The OREE can be regarded as the OAM analog of the well-known Rashba-Edelstein effect (REE), which is characteristic of systems without inversion symmetry and with strong SOC. Sometimes, the OREE is also called the kinetic magnetoelectric effect. A detailed clarification of the different terminologies used can be found in ref. 63. Unlike the OHE, the OREE has been observed and studied for a long time64,65 and was rediscovered by the orbitronics community. It can be described by the linear response formula\nwhere the non-equilibrium OAM density in μ-direction (ℳ_μ^L) generated by the electric field applied in the ν direction (ℰ_ν) is proportional to a matrix-element of the tensor αμν,\nwhere μB denotes the Bohr magneton and τp represents the momentum relaxation time. Eq. (6) is strongly constrained by crystal symmetry66. Since OREE is a Fermi surface effect, the previous equation can be expressed in terms of the charge current as follows:\nwhere 𝒥_ν is the charge current flowing in the ν-direction and βμν = αμν/σνν, with σνν being the longitudinal conductivity. Note that since αμν ∝ τp, the tensor βμν is independent of τp. Figure 3 illustrates the OREE associated with the βzx tensor component in Eq. (7).\nThere are 18 noncentrosymmetric point groups, known as gyrotropic groups, which allow finite matrix elements in the current-induced orbital magnetization tensor66: C1, C2, C3, C4, C6, C1v, C2v, C3v, C4v, C6v, D2d, S4, D2, D3, D4, D6, T, O. In addition, there are 3 noncentrosymmetric point groups, C3h, D3h, and Td, that exhibit the necessary spatial inversion symmetry breaking but do not allow for current-induced magnetization66. The shape of the response tensor for each of the 18 gyrotropic point groups can be found in the literature67. Many subtleties of the microscopic mechanisms underlying the OREE, along with details on the various nomenclatures used in the literature, are discussed in a recent specialized review42. Here, we adopt a simple and intuitive explanation based on the Heisenberg equation of motion for the induced OAM in a solid subjected to an applied dynamical electric field68: dL̂^Ind/dt=-i/ℏ[L̂^Ind,V̂(t)]=r̂× eℰ(t), where V̂(t)=-eℰ(t)·r̂ is a slowly switch-on electric potential. This general quantum mechanical equation indicates that the OREE arises from the torque applied to local electric dipoles within the solid: ℳ^L∝P×ℰ54,69.\nOrbital torques\nFrom a phenomenological point of view, the electric control of magnetization can be understood via the SOC, which acts together with the crystal field as a source of magnetic anisotropy -responsible for the orientation of the magnetization and orbital moments in ferromagnets70,71. Consequently, a variation in the SOC can trigger magnetization dynamics due to the instantaneous change in the system's magnetic anisotropy. Given by ℋ_SOC=λ (r)L̂·Ŝ, the SOC depends on three essential parameters: the electrostatic potential at the vicinity of the nucleus λ(r), the spin Ŝ, and the OAM of the electrons L̂. Thus, changes in the SOC are given by\nwhere the first term in Eq. (8) encapsulates the variation of the atomic Coulomb potential due to the motion of the ions, the second term is related to changes in the spin density of the system, and the third term capture the changes in the OAM density. The first mechanism has been recently explored by Han et al.72 as a way of using the lattice to harvest spin and orbital moments. The second channel connects directly to the spin-orbit torques73, whereas the third describes the orbital torque in which a non-equilibrium orbital density triggers the magnetization dynamics. This mechanism was proposed by Go and Lee in ref. 35. The system they used was a bilayer comprising a non-magnetic material (NM) and a ferromagnetic material (FM) with strong SOC. The NM material is formed by s-p hybridized orbitals (similar to the model used in ref. 28), while the FM includes d orbitals. The equilibrium magnetization M of FM interacts with electronic spins density via exchange coupling H_xc^FM=(J/ℏ)M·Ŝ. The SOC of FM is given by H_so^FM=(α_so^FM/ℏ^2)L̂·Ŝ. When an electric field is applied, a transverse orbital current flows in the NM material due to the OHE. This orbital current is then transferred to the FM, injecting an OAM density, and the angular momentum of this nonequilibrium distribution is transferred to the spins via SOC. This process induces a torque in the magnetization of the FM material. The torque is given by\nwhere ⟨Ŝ⟩^FM is the spin accumulation produced in FM. Note that although the expression of Eq. (9) for OT depends on spin accumulation, it results from the injection of the OAM due to OHE in the NM material described by the third term in Eq. (8). This expression can be decomposed into field-like and damping-like components. While the field-like component arises from the intra-band term of linear response theory, the damping-like term is associated with inter-band contribution35. This phenomenon has been experimentally analyzed in various NM/FM bilayers and represents an important route for manipulating the OAM degree of freedom74,75,76. The reciprocal effect, orbital pumping, has been studied theoretically and its experimental evidence has also been reported39,72,77,78,79. It is worth mentioning that the model described above assumes that the magnetization of a ferromagnet is primarily attributed to the spin sector. In the cases where the ferromagnet has significant contributions from the orbital sector to its magnetization, the model can be generalized80.\nOther orbital phenomena\nThe effects described in Eqs. ((1)–(9)), along with their reciprocal effects, can be viewed as building blocks for orbitronics devices within the generation-manipulation-detection paradigm, which is aimed at enabling efficient storage and processing of information using electronic OAM. Nevertheless, this has not exhausted the pool of orbitronic phenomena that could be useful for this task. Distinct mechanisms of orbital-charge conversion81, orbital Ruderman-Kittel-Kasuya-Yosida interaction80, and the interaction between OAM and pulsed light signals82,83,84 are other topics currently under theoretical and experimental investigation. Here, we focused on the three building blocks, whose mechanisms and key references were outlined above.\nOrbital angular momentum in 2D materials\nOrbital textures\nThe mechanism introduced in ref. 28 to explain the OHE depends on the presence of orbital textures, k-dependent orbital states, even in systems with inversion and time-reversal symmetry85. These textures, which describe the spatial distribution of orbital character, are an important feature in many 2D materials. Within the framework of the intra-atomic approximation (see the next subsection), these textures are associated with k-dependent hopping processes involving different orbitals. However, 2D materials with broken inversion symmetry can give rise to OAM textures, described by ℓ_n(k)=⟨u_nk|L̂|u_nk⟩, where |u_nk⟩ represents the periodic part of the Bloch wave functions. Such OAM textures highlight the unique role of symmetry breaking in 2D materials. They are found in various multi-orbital solids, including monolayers of 2H-TMDs45, bismuthene46, and borophene86.\nAlthough the equilibrium OAM texture is quenched in non-magnetic and centrosymmetric systems, the presence of orbital textures can trigger a non-equilibrium OAM texture responsible for the occurrence of the OHE under the application of an electric field28. Experimental approaches based on analyzing angle-resolved photoemission spectroscopy signals have been developed to access the orbital and OAM textures of 2D materials and the surfaces of 3D materials87,88, applied to both equilibrium and non-equilibrium textures87 and have been successfully used for in-depth studies of many compounds in the TMDs family89,90.\nMulti-orbital v.s. single orbital materials\nIn the low-energy regime, carbon pz orbitals are responsible for the electronic properties of graphene. This part of the Hilbert space, consisting of a single cubic harmonic state, does not support atomic OAM. Much of the discussion above is based on the intra-atomic approximation for the OAM operator, where the OAM of a solid is related to the OAM of individual atoms. This approach, also called the atom-centered approximation (ACA), becomes straightforward when the electronic Hamiltonian is expanded using a tight-binding basis, and it is commonly used in orbitronics. In graphene, the dominance of the pz orbital causes the intra-atomic OAM to vanish, making orbitronic effects impossible under this approximation. A similar situation occurs in s-character band structures. However, electronic wave functions in solids are not always localized around atoms, and contributions to OAM from inter-site electron movement can be significant. This aspect has been explored in magnetic materials, where such contributions affect the equilibrium orbital magnetization. The modern theory of orbital magnetization24,25 has improved theoretical predictions for many magnetic systems and has a substantial impact on more exotic materials, significantly altering results compared to the intra-atomic approximation91.\nFor isolated bands, Kohn demonstrated that Bloch electrons have an intrinsic orbital magnetic moment (OMM)92. Later, Chang and Niu reinterpreted this intrinsic OMM as the self-rotation of an electronic wave packet using a semi-classical approach93. Culcer et al. extended this concept by deriving a non-abelian (matrix) form of the OMM operator for nearly degenerate bands94. Pezo and coworkers further generalized the semi-classical expression of the OMM, incorporating matrix elements from the full Hilbert space95:\nwhere, ∇_k=∂_k_xx+∂_k_yy, and |u_n(m)k⟩ is the periodic part of Bloch wave-function for the band with energy εn(m)k. Eq. (10) is analogous to the expression obtained from the semi-classical approach but is not restricted to the nearly degenerate subspace. The same expression was obtained by ref. 96. As pointed out in ref. 97, an additional term must be added to Eq. (10) to ensure gauge invariance in the case of spaced energy bands. Recently, an additional quantum term has been predicted98.\nAn OAM operator originating from this Bloch OMM can be defined93,99,100:\nwhere, μB is the Bohr magneton and gL = 1 is the Landé g-factor. This operator accounts for both intrasite and intersite contributions to OAM, going beyond the intra-atomic contribution101.\nThe formulation of OHE based on Bloch OMM100 has shown consistency with the intra-atomic approximation in predicting an orbital Hall insulating phase for bilayer of 2H-TMDs49. Nevertheless, the plateaus predicted by the intra-atomic approximation and the OMM approach have distinct heights and dependencies on the spectral energy band gap. Later, similar studies on other multi-orbital 2D materials were carried out95. Interestingly, even for single-orbital solids such as graphene100 and s-orbital lattices102, the formulation based on the OMM approach gives rise to a finite OHE. In these situations, the intra-atomic approximation yields a vanishing OHE, and all contributions must be attributed to the intersite movement of electrons. A pictorial representation of this movement was described in ref. 102. The OREE was also studied in 2D materials using the formulation of Bloch OMM52,53,103,104. Studies on OT are often conducted using the intra-atomic approximation, which simplifies numerical calculations.\nWith the growing interest in comparing theoretical and experimental results, where disorder is an inherent feature of all materials, there is an increasing need for alternative formulations of the OAM operator in real space. One such approach is a basis-independent formulation using Green functions, expressed as:\nthat was introduced by Canonico et al.105. Within this approach, the off-diagonal elements of the position operator r are computed from the perturbation theory methods as ⟨ i|r_α| j⟩ =iℏ⟨ i|v̂_α| j⟩/E_j-E_i (α = x, y, z), where | i⟩ and Ei are the ith energy eigenstate of Hamiltonian Ĥ with eigenvalue Ei. G^-(Ĥ,E) and G^+(Ĥ,E) are the advanced and retarded Green's functions respectively and εαβγ represent the Levi-Civita symbol. The formulation in Eq. (12) has been used to calculate the OHE due to the OMM in real space for disordered systems105. The expressions in Eqs. (10), (11) and (12) are used to describe the transport of OAM via the orbital current definition shown in Eq. (2).\nThe expression of Eq. (12) is inspired in the work of Bianco and Resta26 that represents the macroscopic equilibrium orbital magnetization of a magnetic system as an integral of a local quantity and is equivalent to the more usual expression of the orbital magnetization, where the integration is performed in the reciprocal space:\nThe first line of Eq. (13) represents the macroscopic orbital magnetization as an integral of a local quantity24,26. A is the area of the sample, μ is the chemical potential, 𝒫=∑_ϵ_n < μ|ϕ_n⟩⟨ϕ_n| is the projector over the occupied states, and | Ĥ-μ1| =(Ĥ-μ1)(1-2𝒫)106. This expression exploits the spectral representation of the orbital moment due to its independence on the characteristics of the energy states and is suitable for computing the orbital moment in disordered materials. The second line in Eq. (13) in turn, is the usual expression that exploits the periodicity of clean systems and represents it as a bulk property24,25, i.e., an integral of a geometric quantity over the BZ. Note that in both equations, the orbital magnetization does not depend on the explicit representation of the multi-orbital nature of the band structure. It depends only on the eigenstates and eigenvalues of the Hamiltonian of magnetic material.\nOrbital Hall effect in 2D materials\nThe reduced dimensionality and unique structural properties of 2D materials support the emergence of topological effects. Their planar structure also enables the control of the crystal field environment and manipulation of the symmetries governing the electronic properties. This has been extensively explored in spintronics research on 2D materials. For instance, reducing the symmetry group of a solid can lead to the emergence of novel components in the spin-conductivity tensor58. In many 2D materials, this can be achieved and controlled through strain or proximity effects107,108,109,110,111. Similar behavior is expected in the OAM conductivity tensor47, making these materials a flexible platform for investigating OAM transport properties. As a result, numerous studies have explored orbital transport in 2D materials45,46,47,48,49,69,100,102,105,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131. In this section, we highlight some of the most significant findings in this area, focusing on two key aspects in the orbitronics of 2D materials: the interplay between topological properties and OAM-related effects, and the reformulation of valleytronic concepts in light of the OHE.\nOrbital topology\nThe quantum spin Hall insulator is a topological phase where the bulk of the system has an energy band gap indexed by a ℤ_2 topological invariant, which remains robust against smooth changes to the Hamiltonian. When the Fermi energy lies within this gap, linear response theory predicts a finite spin Hall conductivity, a hallmark of its non-trivial topology. Furthermore, creating boundaries in such systems reveals spin-polarized metallic edge states that carry the spin-Hall current, protected by time-reversal symmetry. This concept, introduced by Kane and Mele, is foundational in the study of topological insulators9.\nWhile these properties are well-established in the spin sector, their analogs in the orbital sector exhibit pronounced differences. refs. 45,46 demonstrated that a finite OHC plateau can arise in certain insulating phases of 2D systems (see Fig. 4b for the OHC of a MoS2 bilayer). The px-py model on a honeycomb lattice, used to describe group-V materials grown on SiC substrates132,133, serves as an example46. In this model, the pz orbital is excluded from the low-energy sector, leaving px and py orbitals to dominate electronic transport. Such orbital filtering provides an example of manipulating the OAM nature of a solid by altering the crystalline environment, a possibility widely explored in 2D materials.\nMonolayers of TMDs with a 2H structural phase exhibit broken inversion symmetry, as can be seen in Fig. 4a if one considers only one layer. This leads to unique OAM-polarized edge states that cross the band-gap region when shaped into a nanoribbon with zigzag edges54,134, shown in Fig. 4c. These edge states are responsible for transporting the OHC54. Notably, monolayers of 2H-TMDs also display an OHC plateau within the insulating gap45. To further understand the origin of the OHC plateau and to differentiate it from effects purely related to inversion symmetry breaking, the OHC was calculated in bilayers of TMDs, which maintain inversion symmetry (see 4a)48 and the plateau OHE persists. However, unlike the quantum spin Hall insulator, the orbital Hall insulator cannot be indexed by a ℤ_2 topological invariant. Instead, the orbital Chern number, introduced in refs. 48,49, serves as a topological invariant for the orbital Hall insulating phase of 2H-TMDs. Monolayers of 2H-TMDs are characterized by an orbital Chern number C_L_z^1l=1, while bilayers have C_L_z^2l=2. In the low-energy regime, where the Hamiltonian of 2H-TMDs can be written as Dirac-like Hamiltonian, the OHC plateau within the intra-atomic approximation is proportional to the orbital Chern number, σ_xy^L_z=(e/2π)2C_L_z49. The edge states in these systems, while related to the orbital Chern number, do not enjoy the same topological protection as those in the quantum SHE due to the absence of a ℤ_2 invariant. Subsequent studies have further explored this topological invariant in other TMDs, showing their susceptibility to topological phase transitions123,124.\nIn refs. 50,51, it was proposed that monolayers of 2H-TMDs exhibit a HOTI phase, characterized by the presence of corner states with fractional charge when the layer is fabricated in a flake geometry that preserves threefold rotational symmetry. These corner states manifest as discrete energy levels within the bulk band gap of the energy spectrum, indicating their topologically protected nature and distinguishing them from bulk or edge states (see Fig. 4d). This higher-order topology is closely connected to the multi-orbital nature of 2H-TMDs. Subsequently, a study47 linked this HOTI phase to a finite OHE within the insulating gap in numerous TMD compounds that crystallize in two distinct structural phases: the non-centrosymmetric 2H phase and the centrosymmetric 1T phase. The connection between HOTI and OHE in these TMD phases was justified using symmetry arguments and supported by a study with an effective Bernevig-Hughes-Zhang toy model. shows the transverse orbital conductivity of TMD insulating monolayers crystallized in the 1T and 2H structural phases. The structure of each material was obtained from the C2DB database135. The transverse spin conductivity vanishes within the energy bandgap for all compounds listed in the tables. Subsequent works have extended the connections between topology and the multi-orbital nature of solids, particularly between HOTI and OHE114,136, in materials like 2D ferroelectrics and superconductors137, as well as in 2D ferromagnets130. Additionally, well-established topological phenomena, such as the quantum Hall effect, are being reinterpreted with advances in understanding the OAM of electrons in solids138.\nOrbital v.s. valley transport\nAn appealing aspect of orbitronics in 2D materials is the often present multi-valley nature of their low-energy electronic structure. This implies that most of their electronic properties are governed by two inequivalent valleys, K and K^', in the Brillouin Zone (BZ). Such electronic structure is common in many 2D materials with a honeycomb structure, such as graphene, hexagonal boron nitride, and 2H-TMDs, among others. The large separation between inequivalent valleys in the BZ suggested that they could be treated as well-defined quantum numbers, allowing them to store information139. Over the last two decades, this idea has been explored in a field known as valleytronics. However, as reviewed in ref. 140, recent experimental and theoretical studies have revealed persistent inconsistencies with this idea despite all efforts at elucidation. In the standard valleytronic interpretation of typical experiments, an electric field applied to the material produces a transverse valley current via the valley Hall effect. Electrons with distinct valley quantum numbers accumulate at the sample edges. Opposite valley states are characterized by inverted OMM, which can be measured, for instance, using Kerr microscopy. In this view, the accumulation of OMM occurs as a secondary effect consequence of the valley Hall effect. This may seem contradictory because the valley quantum number, which serves as the principal transport quantity, is not directly measured. Instead, the accumulated OMM, typically considered a secondary consequence in valleytronics, can be assessed using Kerr microscopy. Additionally, the definition of valley current J_v=-e(v| _K-v| _K^') depends on a valley filtering procedure that cannot be applied to Hamiltonians with strong inter-valley couplings126. Despite the challenges associated with this interpretation140, it has been used to interpret many important experimental results141,142,143.\nIn ref. 100, Bowhal and Vignale argue that the concept of orbital current used in orbitronics could provide a more accurate description than the valley current approach previously utilized in valleytronics. Among other advantages, describing the system in terms of orbital current [using Eqs. (2) and (11)] highlights the OAM-a physical observable probed in experiments-as the primary quantity being transported. Interestingly, orbital and valley current obey distinct symmetry constraints. While the valley Hall effect requires the breaking of time-reversal or spatial inversion symmetry, the OHE does not have such a restriction48,49. For this reason, the valleytronics community believed that centrosymmetric systems, such as the unbiased bilayer of 2H-TMDs, would not exhibit any transverse current response when a longitudinal electric field is applied. Nevertheless, it was later demonstrated that finite OHC could arise, and the resulting orbital accumulation might be detectable through Kerr rotation experiments48,49. Even systems with strong inter-valley coupling, such as graphene with Kekulé distortions, can exhibit considerable OHE126.\nRecently, a study on h-BN/gapped graphene/h-BN moiré superlattice reported a strong correlation between theoretical calculations of OHC and non-local resistance measurements120. Additionally, a recent theoretical study121 describing magnetoresistance due to Bloch OMM accumulation in bilayer systems found qualitative agreement with the experiment reported in ref. 33, strengthening the idea of treating it as the primary quantity of transport. Finally, we mention that materials lacking a multivalley structure and SHE, but exhibiting significant OHC, are promising candidates for unambiguously probing orbitronic effects without interference from competing phenomena that might produce similar experimental signals. Phosphorene, a monolayer of black phosphorus, exemplifies such materials and also exhibits highly anisotropic orbital transport properties128.\nControlling orbital angular momentum in 2D materials\nEffects that allow the manipulation of the OAM degree of freedom, such as the OREE, are closely related to the symmetries of solids62,67. This has been widely studied in the context of spintronics in 2D materials144,145 and, as will become evident, offers opportunities to use these systems as platforms for precise OAM control. Additionally, the ability to fabricate heterostructures from different 2D materials can help designing efficient OT devices-a potentiality that has also been explored by the spintronics community of 2D materials146,147. This section highlights advances in understanding the phenomena that enable OAM control in 2D materials.\nOrbital Rashba Edelstein effect in 2D materials\nIn contrast to other orbitronic effects, OREE has been studied both theoretically and experimentally in 2D materials52,55,148,149,150. Many 2D materials belong to the non-centrosymmetric D3h point group, where the linear Edelstein effect is forbidden by symmetry [see discussion below Eq. (7)]. A crucial constraint in 2D materials for allowing OREE is that they can only have one mirror plane perpendicular to the plane of the material. This constraint helps explain why applying strain or cutting the system into a ribbon, thus introducing additional symmetry-breaking elements, can promote the appearance of the OREE. For instance, monolayers of 2H-TMDs, which belong to the D3h point group, can exhibit a finite current-induced orbital magnetization when their three-fold rotational symmetry is broken through uniaxial strain. This reduces the crystal's point-group symmetry to C2v and enables the OREE, as observed experimentally in ref. 55 and discussed theoretically in ref. 53. Furthermore, fabricating 2D materials in a nanoribbon geometry can reduce their point-group symmetry without the need for a strain field, helping the onset of OREE54,69.\nMagnetic 2D materials, such as CrI3, exhibit broken time-reversal symmetry, and an equilibrium orbital magnetization may appear. Bilayers of these materials with interlayer antiferromagnetic configuration have the interesting properties of breaking time-reversal (𝒯→×) and spatial-inversion (𝒫→×) symmetries individually while preserving their combined operation (𝒫.𝒯→✓). In this case, it is possible to modify the equilibrium orbital magnetization using an electric field without the flow of charge current; that is, a field-induced modification of orbital magnetization can be achieved151. This implies that even in an insulating state, the OAM can be controlled. This effect resembles the OREE but is governed by distinct symmetry properties62 and a different microscopic mechanism. Along with the OREE, it belongs to the more general class of orbital magnetoelectric effects (see details on nomenclature in ref. 63). We note that induced orbital magnetization can arise even in higher-order terms in the electric field expansion. This phenomenon corresponds to the non-linear orbital Edelstein effect148,152. Experiments reporting this effect in 2D materials are already available149. Such non-linear phenomena are often studied by the light-matter interaction community, where orbitronics in 2D materials is also under investigation125,127,131.\nTorques and OAM in 2D materials\nOrbital torque (OT) has been more extensively investigated in three-dimensional metallic material systems, with only a few studies explicitly addressing torques associated with electronic OAM in 2D materials. In 2D systems, relying solely on the OHE to generate OT is challenging because the OHE induces orbital accumulation at the edges of the plane. However, the OREE provides a more effective mechanism by generating orbital magnetization throughout the entire plane. When a 2D magnetic layer is in contact with a material exhibiting OREE, this orbital magnetization can exert torque on the magnetic layer, enabling OT.\nRecent theoretical works have begun to explore OAM-related torque phenomena in 2D materials. Calculations by Atencia and co-workers153 suggest the existence of an intrinsic torque on the OAM of Bloch electrons in the presence of an electric field, rooted in interband terms and related to the quantum metric tensor. This torque vanishes in two-band systems with particle-hole symmetric band structures but can be nonzero for tilted Dirac fermions. In ref. 154, Canonico and co-workers report numerical calculations indicating a spin-orbit torque in the centrosymmetric 1T-TMD PtSe2, arising from the entanglement between spin and the OAM texture of electrons, which is distinct from conventional spin-orbit torques in non-centrosymmetric systems.\nAlthough these studies are not directly related to the OT mechanism introduced in ref. 35, they address phenomena rooted in electronic OAM that could be used for similar purposes. Given the significant impact of spin-torque phenomena on the spintronics community of 2D materials155,156 and the increasing sophistication in fabricating diverse van der Waals heterostructures, it is expected that research into OAM torque phenomena in 2D materials will expand in the coming years. These torque effects may play a crucial role in future applications within these advanced heterostructures56,57.\nEffects of disorder\nBeyond idealized models, real-world applications of orbitronics require further investigation into the role of disorder, which is prevalent in the large-scale fabrication of any device. Building on the parallelism between spintronics and orbitronics, critical metrics157 for addressing the performance of orbitronic devices, such as orbital diffusion lengths and charge-to-orbital conversion efficiency, can be altered and even enhanced by disorder. In the following, we separate the orbital relaxation and the extrinsic contributions to the OHE and recollect recent experimental and theoretical work on these topics.\nOrbital relaxation and orbital dynamics\nThe experimental values of the orbital diffusion length obtained by different methods and for different materials vary considerably, prompting further investigations into orbital relaxation and the influence of disorder. For example, Choi et al.31, using MOKE and orbital torque measurements in Ti and Ti/FM systems, obtained orbital diffusion lengths of 74 ± 24 nm and 50 ± 15 nm, respectively. The latter value agrees with previous estimations made for similar heterostructures75. In contrast, similar MOKE measurements conducted by Lyalin et al. in Cr reported orbital relaxation lengths of 6.6 ± 0.6 nm32. Similarly, orbital Hanle magnetoresistance measurements of Sala et al. in polycrystalline Mn suggested orbital relaxation lengths of  2 nm33, which, surprisingly, are in close agreement with the estimates of Liu et al. in CoPt/Cu/MgO heterostructures158.\nAlthough these experimental data suggest that disorder may limit orbital conductivity, other studies indicate the opposite. Kim et al.159 measured orbital relaxation lengths of  10 nm in Cu samples using orbital torque measurements. These findings align with later estimations for CoFe/Cu/TiO2 and CoFe/Cu/SiO2 structures, where the oxygen atoms of the oxides hybridize with copper, favoring orbital transport160. Similarly, Seifert et al.82 observed ballistic orbital propagation over distances exceeding 20 nm, consistent with earlier experiments by Hayashi et al.75. Furthermore, recent experiments by Idrobo et al.161 examined orbital relaxation in Ti-based devices and found orbital relaxation lengths of 7.9 nm, with a strong dependence on sample morphology.\nThe varying estimates of orbital diffusion lengths suggest that orbital dynamics operates differently from spin dynamics, which could potentially provide a method to distinguish between spin and orbital signals.\nHan et al.162 noted that spin and OAM operators exhibit distinct anti-comutator relations. Specifically, while {S_i,S_j}∝δ_ij, {L_i,L_j} is proportional to the orbital quadrupole density163. These characteristics enable L − k coupling, but prevent S − k coupling in centrosymmetric non-magnetic systems. As a result, this can lead to unique features in orbital current diffusion that are not present in spin current diffusion, highlighting qualitative differences between orbital and spin dynamics.\nSohn et al.164 investigated coupled spin-orbital dynamics in centrosymmetric materials using quantum kinetic theory and device simulations. Their study demonstrated that orbital-momentum locking, arising from the orbital texture, leads to a Dyakonov-Perel-like orbital relaxation, suggesting that frequent momentum scattering disrupts orbital precession, reducing dephasing and thereby increasing relaxation times. Conversely, ref. 165 found a different behavior when studying the decay of orbital currents using first-principles quantum-mechanical scattering calculations. By injecting orbital currents from an orbitally polarized lead into bulk transition metals, they observed that the orbital current persisted for only a few atomic layers, indicating a relaxation mechanism different from the one predicted in ref. 164.\nRecent calculations for a 2D tight-binding model using a quantum Boltzmann equation approach that takes into account different impurity models show that the impurity-potential symmetry strongly influences the OAM relaxation, which can change from Dyakonov-Perel-like to Elliot-Yafet relaxation if the axial symmetry of the impurity potential is broken166.\nDespite growing interest in orbitronics, there are currently no direct measurements or systematic studies of the orbital diffusion length in 2D materials. Most of what is known experimentally concerns spin transport in TMDs, where spin diffusion lengths are typically short. However, orbital relaxation mechanisms can differ substantially. For example, in monolayer 2H-TMDs, the OAM near the K and K^' points is strongly constrained by symmetry, which inhibits scattering events that would flip the orbital moment. This symmetry protection suggests the possibility of enhanced orbital diffusion in selected regions of momentum space. While this remains speculative, it motivates further theoretical and experimental work to clarify whether long-range orbital transport can be realized in these systems.\nDisorder effects and extrinsic contributions to the OHE and OREE\nDiscrepancies in estimates of orbital diffusion lengths also suggest that extrinsic contributions may influence orbital currents and OAM accumulation.\nSince the early days of spintronics, the effects of the disorder have been thoroughly studied and discussed2. Beyond influencing spin relaxation and decoherence, disorder can also give rise to the SHE through extrinsic mechanisms such as skew scattering and side-jump. These impurity-driven effects can generate spin currents even in materials where intrinsic mechanisms are weak or absent, demonstrating that disorder can play a fundamental role in spin transport phenomena.\nIn orbitronics, similar extrinsic mechanisms are expected to influence orbital transport, potentially generating OHE. Just as skew scattering and side-jump effects can drive the SHE, these mechanisms are also predicted to affect orbital dynamics by deflecting OAM currents in the presence of impurities. Although the study of disorder-driven orbital transport is still in its early stages, recent works have begun to explore how extrinsic contributions affect the OHE and orbital accumulation. It is noteworthy that these studies deal with effects of disorder on orbital transport by using either the atom-centered (intra-site) approximation (ACA) or a purely itinerant OAM, which incorporates inter-site contributions.\nThe seminal paper of Bernevig et al.17 discusses the effect of disorder in p-doped semiconductors within the ACA. They argued that due to the symmetry of the system under investigation, the effects of disorder appear as self-energy corrections in their linear response calculations, due to the cancellation of the vertex corrections in the current operators. Tanaka et al.19 demonstrated that, for transition metals, the vertex correction considered within the first Born approximation has a negligible impact on the spin and orbital Hall conductivities. Similar trends were obtained in recent work by Pezo et al.119.\nRecent work by Tang and Bauer167 investigates how random defect scattering influences the OHE. They used a quantum Boltzmann equation to examine a two-band (px-py) model on a triangular lattice, incorporating the so-called vertex corrections. Their findings reveal that even a weak disorder can significantly affect and may completely suppress the intrinsic orbital Hall current.\nIn contrast, for a 2D tight-binding model, a quantum Boltzmann equation approach with third-order perturbation theory shows the appearance of a sizable extrinsic contribution to the OHE. The extrinsic contribution depends on the impurity concentration, in line with the skew-scattering mechanism166.\nThese results show that the influence of vertex corrections on OHE varies depending on the specific model studied. In principle, the discrepancies can be explained with Dimitrova's argument168, which was originally introduced in the context of the SHE. This argument is based on general conservation laws that govern the time evolution of the system169, which depend on the lattice symmetry and the angular momentum character of the model. For instance, by applying Dimitrova's argument to orbital transport in the px-py model on a triangular lattice, one obtains that the orbital Hall conductivity must vanish, which is consistent with the findings of ref. 167.\nMeanwhile, other studies explored the OHE in two-dimensional massive Dirac fermions, originating from the itinerant OAM. Liu and Culcer129 employed a quantum kinetic approach to study the effect of short-range Gaussian disorder, taking into account vertex corrections. They discovered that in doped systems, extrinsic Fermi surface contributions can lead to a substantial increase of the OHE, which also aligns with Dimitrova's argument. However, their approach does not capture the dependence of the OHE on impurity concentration and strength.\nCanonico et al.105 developed a real-space numerical methodology capable of capturing disorder effects on the OHC non-perturbatively. Their results suggest that disorder can enhance the OHE across different transport regimes-from ballistic to diffusive-and eventually suppress the OHE near localization.\nFurther theoretical studies by Veneri et al.118, using a nonperturbative description of disorder in the dilute regime, found that extrinsic contributions to the OHC are dominated by the skew-scattering mechanism. In this regime, the OHC is proportional to the inverse of the impurity concentration, meaning that as impurity concentration decreases, the skew-scattering effect becomes more significant, leading to an increase in OHC. These findings elucidate the origin of extrinsic contributions and emphasize the role of perturbation symmetries in shaping the extrinsic OHC. A subsequent work performed a similar analysis but for centrosymmetric bilayer 2H-TMDs122.\nThese findings challenge the prevailing notion that intrinsic mechanisms dominate the OHE, suggesting that extrinsic scattering plays a crucial role, especially for experimentally relevant impurity concentrations.\nMost studies examining the effects of disorder on the OREE adopt the Bloch OMM approach. Zhu et al.170 derived a general formula for calculating the orbital magnetization in disordered systems, using the Keldysh Green's function formalism. They applied it to calculate the orbital magnetization of a weakly disordered two-dimensional electron gas (2DEG) with Rashba SOC, and found that the orbital magnetization is robust to weak-scattering short-range disorder, which mainly causes a rigid energy shift in the orbital magnetization distribution.\nAdditionally, Rou et al.171 found through semiclassical calculations that charge-to-orbital conversion has two extrinsic contributions due to weak disorder: skew-scattering and side-jump. Although weak disorder can enhance charge-to-orbital conversion, due to its linear dependence on the scattering time, it can be rapidly disturbed in heavy disorder situations. Further investigation into the non-perturbative disordered regime in 2D materials is needed.\nFuture directions\nThe field of orbitronics in two-dimensional (2D) materials is currently experiencing a stimulating phase, with prospects of development along several lines. However, some challenges need to be addressed to fully realize its potential. One of them is the difficulty in disentangling the contributions of spin and OAM to magnetic moment accumulations, especially in 2D materials with relatively strong spin-orbit interactions. Extracting these contributions requires the use of more refined experimental techniques, possibly involving optical probes. There is now direct evidence that OAM currents can be induced and flow through materials even with negligible spin-orbit interaction. Furthermore, these currents can also generate spin currents via SOC. Therefore, careful interpretation of the experimental results is required to accurately identify and quantify the contributions of OAM to spin-orbitronic processes.\nAnother promising line of investigation is exploring the manipulation of hybridization between atoms in 2D materials to enhance the capabilities of orbitronics. For instance, pristine graphene is formed by sp2-hybridized carbon atoms, resulting in primarily pz states near the Fermi level with no multiorbital character. However, in fully hydrogenated graphene, the carbon atoms undergo sp3 hybridization, which causes the valence band to exhibit a multi-orbital character that can be manipulated through strain23,172. Furthermore, proximity effects have been successfully employed in spintronics to induce SOC in graphene4. Similarly, the close proximity of orbitronic materials to conductive materials can lead to new orbital hybridizations111 that may facilitate the transport of OAM currents across heterostructures. This approach could open up new possibilities for integrating orbitronics into existing 2D material platforms, enabling efficient OAM transport and expanding the scope of potential applications.\nIdentifying and engineering 2D materials capable of efficiently transporting OAM currents with minimal damping is critical. Relaxation of OAM poses a significant challenge for the practical implementation of orbitronic devices, as it limits the effective transmission distance of orbital information. Future research should focus on materials exhibiting inherently low OAM relaxation rates or explore strategies to mitigate relaxation through material design or external control. The inherent flexibility of 2D materials makes them particularly well suited for such design optimizations, providing a versatile platform for the development of advanced orbitronic technologies.\nExploring and optimizing orbital torque in 2D materials is also a promising area for future research. A key step toward demonstrating orbital torque in 2D systems is to achieve orbital accumulation at the interface with a 2D ferromagnet. This could enable torque via orbital-to-spin conversion, or potentially involve direct coupling to orbital magnetization in systems with appreciable unquenched orbital moments-an interesting direction that remains to be explored. The use of magnetic materials, as sources of OAM currents, is also very encouraging. The breaking of time-reversal symmetry in the Hamiltonian of magnetic materials results in distinct components in the angular momentum conductivity tensor, which would not be present in a nonmagnetic system. These components can be derived using symmetry arguments59,173. They can generate OAM currents with unconventional polarizations, expanding the possibilities for spin-orbitronic applications. A wide range of 2D magnetic materials is currently available174, exhibiting electronic properties that range from metallic175,176 to insulating177,178,179. Exploring new phenomena in these materials will undoubtedly be a key focus within the field of orbitronics.\nThe thin and flexible nature of 2D materials makes them ideal for developing compact, low-power devices, where efficient torque generation can enable advances in magnetic switching and data storage technologies.\nData availability\nNo datasets were generated or analysed during the current study."
  },
  {
    "DOI": "10.1038/s43246-025-00907-y",
    "title": "Progress towards efficient MXene sensors",
    "link": "http://dx.doi.org/10.1038/s43246-025-00907-y",
    "notes": null,
    "text": "Abstract\nMXenes, a new class of two-dimensional transition metal carbides and nitrides, have gained significant research attention due to their exceptional physicochemical properties, making them attractive as active materials for sensing applications. These sensors have diverse uses, including gas sensors for pollutants, biosensors for diagnostics, strain sensors for wearables, and optical sensors for light or chemical changes. They leverage on MXene's unique conductivity, surface and redox reactivity, optoelectronic properties, and thermal behaviour, highlighting their versatility across various technologies. Despite progress, key challenges such as material limitations, processing difficulties, limited real-world testing, and lack of scalable manufacturing, still hinder commercial adoption. This review summarizes the recent progress in MXene-based sensors, examines these challenges, and aims toward the development of cost-effective, high-performance sensors for soft electronics. It also provides guidance for the future development of more efficient sensors and aims to inspire innovations in the field.\nSimilar content being viewed by others\nIntroduction\nMXenes, a family of two-dimensional (2D) transition metal carbides and/or nitrides, have gained considerable attention across various fields due to their highly processable layered structure and remarkable physicochemical properties1,2,3. Since 2011, over 50 MXene compositions have been reported, with many unique carbide/carbonitride combinations theoretically predicted (Mn+1XnTx, where n = 1-4, M = transition metal, X = carbon and/or nitrogen, and T = surface functional groups such as -O-, =O, -OH, -F, -Cl)4,5. One widely studied example is Ti3C2Tx MXene, which stands out among 2D nanomaterials for its exceptional electrical conductivity (>20,000 cm−1)6,7,8, electrochemical behavior (e.g. capacitance > 2800 F cm−3)9,10,11, surface reactivity, opto-electronic properties, and thermal stability. This combination of properties makes MXenes highly suitable for diverse sensing applications, including gas sensors for detecting pollutants12 and toxic gases13, biosensors for medical diagnostics14 and health monitoring15, strain sensors for wearable electronics16, and optical sensors for detecting light or chemical changes17. Recent studies have focused on enhancing the selectivity and sensitivity of MXenes through surface functionalization18, structural modifications19 (e.g., doping), and composite formation20,21.\nIncorporating MXene into a host material does not diminish its exceptional properties, unlike most other 2D nanomaterials22,23, enabling molecular imprinting of polymers24 or decoration of ligands25 on the sheet surface without losing conductivity. These surface modifications can create additional active sites for analyte interaction, thereby improving detection capability, selectivity, and overall sensing performance. Likewise, incorporating MXene into polymer matrices improves their electrical conductivity, even with low MXene loading, resulting in durable, lightweight, and highly sensitive physical sensors ideal for wearable electronics26,27,28, healthcare monitoring29, and soft robotics applications30,31.\nAdvancements in improving the performance of MXene-based sensors have laid the groundwork for their potential commercialization21,32,33. However, achieving industrial-scale production necessitates overcoming key challenges, such as MXenes' susceptibility to oxidative degradation. Achieving multifunctionality requires balancing properties without compromising performance. Scalability remains a challenge due to the complex synthesis and fabrication processes, which must be understood and optimized for large-scale manufacturing while maintaining material properties. This review offers insights into these relevant obstacles to identify methods that enhance sensor performance while uncovering the fundamental and practical limitations of existing MXene-based sensing materials. It also critically analyzes how these factors impact the fabrication of target sensing platforms, aiming to resolve performance issues related to material defects and architectural mismatch. Addressing these impediments is expected to accelerate the development of next-generation MXene-based sensors.\nSpecific challenges in developing MXene-based sensors\nWhat makes MXenes good materials for sensors?\nMXenes are highly versatile materials for diverse sensor applications. Their outstanding properties, including high electrical conductivity34, chemically active surfaces35, and single-sheet mechanical flexibility36, meet the critical requirements for effectively responding to various stimuli37. For example, their combination of mechanical flexibility and electrical conductivity makes them ideal for pressure and strain sensors used in wearable devices, robotics, and structural health monitoring. MXene-based fibers have been investigated for their responsiveness to external stimuli, such as humidity changes38,39, due to their surface chemistry and hydrophilicity.\nTheir tunable 2D structure facilitates rapid ion transport, enabling swift response times and enhanced sensitivity for superior sensing capabilities40. This makes them highly preferable in gas sensors for detecting various gases such as NH341,42, CH443,44 and CO245. MXenes can also be used in electrochemical sensors for detecting a wide variety of chemical species, ranging from pollutants (e.g. pesticides)46 and heavy metals (e.g. cadmium and lead)47 to biomarkers (e.g. human anti-ASGPR)48.\nAs mentioned above, the versatility of MXenes' chemistry and the variety of structures allow for the development of different sensor types. For simplicity, we categorized these sensors into three groups :\n-\n1.\nPhysical sensors, which rely on structural deformations to change resistivity or capacitance.\n2.\nChemical/electrochemical sensors, which detect changes in resistance and electrochemical behavior from interactions with the MXene surface.\n3.\nOptical/spectroscopic sensors, which use MXene's optical properties to detect stimuli such as light, chemicals, and biomolecules.\nBased on the current literature, we have identified some key challenges associated with the fundamental mechanism and device fabrication processes. These challenges include understanding the underlying principles that govern sensor performance and optimizing fabrication techniques to ensure consistency and scalability.\nCommon challenges faced by MXene-based sensors and how we can solve them\nPhysical sensors\nPhysical sensors detect physical changes in the environment, such as strain, pressure, temperature, or light, and convert them into electrical signals49, for applications that include healthcare50, robotics51, and wearables52. MXenes are effective for physical sensors due to their exceptional electrical conductivity53, charge storage capability54, and piezoresistive properties49. To improve responsiveness to physical changes, MXenes are typically used to modify composites, amplifying signals through their inherent conductivity, enhancing device sensitivity, response time, and stress/strain detection33. Notably, Ti3C2Tx remains the most conductive MXene reported and is currently the preferred choice for this type of sensor. For this section, we discussed common types of MXene-based physical sensors, such as strain, pressure, acoustic, and temperature sensors, with a comprehensive summary of representative examples in .\nStrain sensors\nA strain sensor operates on the change in electrical resistance when a material is subjected to stretching55,56. Effective strain sensors must provide a wide working linear range with consistent responses and demonstrate stability over at least 500 loading/unloading cycles to endure dynamic use. The layered structure of MXenes is advantageous in accommodating mechanical deformations while maintaining functionality, with a high gauge factor (GF), the figure of merit for sensitivity, which ensures precise strain detection. The MXene-based sensing behavior mainly relies on the disruption of the interconnected Ti3C2Tx flakes when strain is applied, altering the material's overall electrical resistance (-i)57,58. The high conductivity of Ti3C2Tx maintained over a wide sensing range allows for higher sensitivity, making MXene-based sensors effective for precise sensing applications, such as heartbeat monitoring57. The versatility of sensor design is also possible due to MXene's compatibility with many polymers, which eases its processing into films, aerogels, or fibers3. MXenes can be incorporated into fibrous structures (e.g., coated yarns), enhancing stretchability and allowing integration into textiles. These sensors have higher strain detection limits and mechanical resilience, making them ideal for wearable devices, robotics, and flexible electronics. For example, Yang et al. developed Ti3C2Tx MXene@TPU sensors by spin-coating MXene dispersions onto electrospun thermoplastic polyurethane (TPU) mats, achieving high sensitivity (GF = 228 and LOD = 0.1%), with a working range up to 150% strain59. However, for most of these studies, the washability of Ti3C2Tx, stemming from ineffective coating techniques, remains a limitation, warranting further investigation. The selected fabrication technique, such as spin coating, printing, or layer-by-layer assembly, directly affects film uniformity, adhesion, and strain transfer efficiency between the MXene layer and the substrate. Inconsistent control of these factors can lead to significant variations in sensor output, increased hysteresis, accelerated fatigue, and ultimately, reduced performance and reproducibility across batches.\nTo address coating issues and improve material utility, methods focusing on substrate compatibility and optimized Ti3C2Tx integration have been explored. The work of Uzun et al.60 demonstrated that highly conductive MXene-coated cotton yarns can be knitted with equipment used in the textile industry (-ii). After 45 cycles of washing, the MXene-coated cotton yarns showed only a minimal increase in resistance (-iii), attributed to the strong H-bonding of the cellulose-rich fibers with MXene. Sensor performance can be further improved by chemically modifying the interaction between MXene and substrates, which is advantageous for non-fibrous architectures61, which typically have fewer anchor points for MXenes. For instance, an interface binder such as polyacrylonitrile (PAN) can enhance the interaction of MXene with a TPU substrate during electrospinning. The resulting MXene/TPU/PAN strain sensor achieved a wide sensing range of 0-80%, GF of 9.69, LOD of <0.1%, and durability after >1750 cycles62. Flexible substrates such as TPU or polydimethylsiloxane (PDMS) can also be layered with MXenes to extend the strain detection range while maintaining high conductivity, enabling sensors to withstand larger deformations. Seyedin et al. demonstrated the continuous fabrication of wet-spun MXene/PU coaxial fibers, which are both highly conductive and stretchable. These fibers, featuring an MXene/PU core surrounded by a flexible PU sheath, exhibited a low percolation threshold of ~1 wt% MXene and outstanding strain sensing capabilities, with a GF of ~12,900 at 152% strain. This coaxial design also enhanced the fibers' stability under cyclic deformation57.\nIt is important to note that the amount of MXene incorporated critically affects the percolation network and gauge factor. Insufficient MXene loading can result in poor conductivity and low signal-to-noise ratios, while excessive loading may reduce sensitivity due to limited strain-induced resistance changes.\nOther 2D materials, such as graphene, can also be integrated to enhance the strain sensing performance of MXene sensors 63,64. In the study by Taromsari et al., a graphene nanoplatelet (GnP)-MXene hybrid was used to form a strain sensor with enhanced strain sensitivity (GF ~ 400 at 100% strain) and cyclic stability after over 2000 cycles.\nPressure sensors\nA pressure sensor generally consists of a force-sensitive layer, conductive electrodes, and a flexible substrate that works by converting the physical force exerted by pressure into an electrical signal52. MXene-based pressure sensors use piezoresistive, piezoelectric, capacitive, triboelectric, and potentiometric properties, causing electrical resistance variations under pressure (-i)65.\nIn piezoresistive sensors, MXene is used as a force-sensing layer, with its conductivity changing in response to external pressure. An example is the piezoresistive sensor built by Ma and co-workers using an ultralight and superelastic MXene/reduced graphene oxide (MX/rGO) hybrid 3D aerogel with exceptionally high sensitivity (22.56 kPa-1), rapid response time (<200 ms), and excellent stability over 10,000 cycles66. Meanwhile, a capacitive pressure sensor (CPS) detects the change in capacitance from the altered separation distance between two parallel electrodes67. The development of CPS devices faces difficulties in achieving both optimum mechanical properties and high sensitivity. An example of a study addressing this challenge is the work by Sharma et al., which demonstrated the fabrication of a wearable CPS utilizing a MXene (Ti3C2Tx)/poly(vinylidene fluoride-trifluoroethylene) (PVDF-TrFE) composite scaffold as the dielectric layer to enhance LOD (1.5 Pa), pressure range (up to 400 kPa), and mechanical stability for over 10,000 cycles under high pressure (~167 kPa)68. Similar challenges are also common for piezoelectric sensors. In the study by Wang et al., MXene's non-centrosymmetric lattice was utilized to enable charge polarization under external force, generating a piezoelectric effect, which was further enhanced by the piezoelectric properties of PVDF-TrFE. PVDF-TrFE/MXene composite nanofibers developed using electrospinning exhibited improved piezoelectric performance, with a peak-to-peak output voltage of 1.58 V (three times higher than pure PVDF-TrFE), a linear pressure response, and an energy harvesting capability of ~3.64 mW/m2 (-ii)69. For triboelectric sensors, difficulties in satisfying high dielectric constant, large electron affinity, and surface area to improve charge density were mitigated by using MXene as an electrode material. This was demonstrated in the development of a triboelectric nanogenerator (TENG) using MXene, carboxylic acid-functionalized single-walled carbon nanotubes, and a fluorinated polymer matrix, performing at an outstanding output voltage of ~300 V, current of ~40 μA under 20 N force, and 92% charge retention after 1 h. Its superior durability and mechanical stability enabled it to power wearable electronics and support a wearable pH monitoring system70,71. Lastly, potentiometric sensors utilize MXene's flexibility and functional groups for redox reactions, providing self-powered, stable electrical signals without the need for external energy sources, ideal for miniaturized electronic skin71.\nAnother critical factor in integrating MXene into pressure sensors is selecting an optimal microstructure for the force-sensitive layer to enhance performance. To improve the pressure detection range and sensitivity, MXene is incorporated into porous structures (e.g., aerogels and foams) to increase the surface area for conductive pathways. Recent developments include the fabrication of a compressible, lamellar aerogel by combining MXene nanosheets with cellulose nanocrystals (CNCs) to prevent restacking during fabrication. The stable lamellar structure ensures elasticity and stable signal response under pressure, making it ideal for wearable piezoresistive devices and biosignal detection72. MXene-based fibers and fabrics can also improve the interaction between the force-sensitive and electrode layers, enhancing response speed and sensitivity. As example, a wearable, washable pressure-sensing fabric was created by utilizing the natural roughness of cotton fibers and MXene's functional groups to achieve strong interfacial interactions. The MXene-coated fabric showed high pressure sensitivity (gauge factor of 7.67 kPa−1), fast response (<35 ms), and long-term durability (>2000 cycles), and was demonstrated as a flexible human-machine interface with multitouch capabilities and rapid response times73. These techniques enable MXene sensors to achieve high sensitivity, fast response, and long-lasting durability due to the capability to produce structures with optimized electrical conductivity and mechanical flexibility.\nHowever, MXene's pressure-sensing capabilities also lag those of other composites. For instance, rGO/PET-based fiber sensors were found to outperform their MXene/PET counterparts due to the limitations of MXenes discussed in the previous sections74. Modifications to its structure or integration with supporting materials could enhance performance and expand its applications.\nAcoustic sensors\nAcoustic sensors detect sound or vibrations and convert them into electrical signals. Selecting materials with high conductivity and piezoelectric characteristics is key to efficient signal conversion. Flexibility and compatibility with various surfaces that maximize sound adsorption further enhance their application potential. Moreover, suitability for compact designs is essential for seamless integration into portable or wearable devices75.\nProminent MXene-based acoustic sensors include a highly sensitive artificial eardrum using double-layer films of MXene, PDMS, and poly(ethylene) (PE) (-i)76. MXene nanoflakes were evenly distributed within a pyramid-shaped PDMS structure, leveraging two enhancements: the large interlayer spacing in the MXene layer and the PDMS micro-pyramid design (-ii). This sensor demonstrated high sensitivity (62 kPa−1), low-pressure detection (0.1 Pa), and a working frequency range of 0.15-3 kHz, showcasing its potential for wearable human-machine interaction devices. These advancements in MXene acoustic sensors show promise for speech recognition applications.\nHowever, refinement is needed to enhance their frequency response and detection limits for more effective human voice sensing75. MXenes have low sensitivity at low pressures and a limited frequency range due to their inherent stiffness and excessive electrical conductivity, which hinder their ability to detect small pressure changes and high-frequency sound waves effectively77. Hybrid assemblies of MXenes and transition metal dichalcogenides (TMDs) address key limitations of MXenes as acoustic sensors. The piezoresistive properties and chemical stability of TMDs improve the sensor's robustness, durability, and frequency range. This synergy enhances sensitivity, enabling more accurate detection of sound across a wider range of frequencies, making the hybrid structures ideal for applications like voice recognition and environmental monitoring. In a study by Chen et al., they developed a machine-learning-based speech recognition system using flexible MXene/MoS2-coated plastic substrates78. The combination of flexible substrate and nanomaterial hybrid enhances mechanical strength, enabling the composite to vibrate with sound, alter resistance, and distinguish sound frequencies and volumes.\nTemperature sensors\nTemperature sensors detect changes by converting thermal energy into electrical signals. MXenes, especially Ti3C2Tx, are favored for this type of sensor due to their excellent electro-thermal and photo-thermal conversion capabilities in sensor design79. However, due to MXene's high electrical conductivity, the resistivity does not change significantly with temperature, requiring additional treatments for enhancing temperature sensitivity. To address this, Tran et al. formulated a composite of MXenes and poly(2-(dimethylamino) ethyl methacrylate) (PDMAEMA)80. As the temperature decreases, PDMAEMA aligns perpendicularly to the substrate, increasing the spacing between MXene flakes and reducing conductivity. This resulted in an MXene composite with a conductivity that responds more significantly than pure MXene to temperature shifts between 25 and 40 °C21,81. Cao et al. also fabricated a temperature sensor using an MXene and PDMS substrate hybrid. When heated, the PDMS substrate swells, causing the MXene flakes to disrupt the percolation network, leading to a significant increase in the MXene resistance82.\nSignificant progress in this area has focused on solving mechanical instability during repeated temperature-response cycles, as swelling or realignment of polymers and additives can damage the sensing architecture. These issues were mitigated by using temperature-stable polymers and robust structures for support. Zhao et al. developed a tissue-like sodium alginate hydrogel-based temperature sensor that operates across a wide temperature range (−20 to 100 °C), with the MXene providing conductivity and thermal responsiveness, while the SA-coating layer enhances heat sensitivity 83. In a recent study, Fu et al. designed MXene fiber artificial muscles (MFAMs) with tensile actuation capabilities upon heating. As the temperature increases from 25 to 125 °C, the intra-sheet spacing of MXene decreases, resulting in a reversible muscle contraction of up to 21.0%84. These advancements highlight MXenes' potential for high-performance temperature sensors, leveraging their thermoelectric properties, flexibility, and conductivity.\nPhoto-sensitive sensors\nMXene-based photosensors use the properties of MXene to interact with light, triggering structural changes. An early example is Chertopalov's work using partially oxidized MXene as a photo-responsive material. Here, the spontaneous oxidation of MXene thin films produces Ti3C2Tx-TiO2 composites with resistance that can vary upon UV irradiation85. Although MXenes generate heat from absorbed light, the architecture lacks significant resistance changes with temperature, requiring additional treatments for enhanced sensitivity. In the study of Xiao et al., they presented a flexible actuator composed of paraffin wax (PW) and a Ti3C2Tx-rich layer. As MXene photothermally facilitates the evaporation of adsorbed moisture within the layers, the asymmetric distribution of the hydrophobic (PW) and hydrophilic (MXene) components causes an uneven change in d-spacing, making the film bend under intense sunlight and stretch under normal light conditions, enabling inchworm-inspired crawling motion 86. Similarly, a study by Luo et al. demonstrated a bilayer actuator by spraying MXenes onto a plasma-treated LDPE film87. These modification approaches have opened a new generation of MXene-based actuators for soft robotics and wearable devices with adaptive structures.\nChemical sensors\nChemical sensors, including chemiresistive, chemicapacitive, and electrochemical sensors, convert signals arising from chemical interactions between the sensor material and an analyte into analytical signals that are correlated with the amount of analyte interacting with the material surface. Generally, these sensors experience a change in impedance when an analyte binds to the surface, expressed as higher or lower resistance, voltage, or current. The majority are used as biosensors for analytes like biomolecules88,89 and biomarkers90,91,92, as MXene under certain conditions has also shown exceptional biocompatibility93,94. Additionally, MXenes possess a unique combination of metallic-like conductivity and highly reactive surface terminations, which enhances bremains uncertain due to a lack of extended experimental dataoth charge transport and interactions with target analytes. The diverse interactions of MXenes with chemical species have enabled the development of various sensors. This section summarizes and highlights three key types of MXene-based chemical sensors and their associated challenges.\nChemiresistive sensors\nChemiresistive sensors measure variations in electrical resistance brought about by analyte adsorption on the sensor surface, altering charge carrier density95,96. Due to the simple and indiscriminate nature of the mechanism, chemiresistive sensors are ideal for applications requiring high adsorption and response rates, like gas sensing. Materials with reactive or porous surfaces capable of high signal-to-noise (S/N) output, including metal oxides97,98, carbon nanomaterials99,100,101, and conducting polymers102, have found success in the field but suffer from high operating temperatures, low processability, and declined performance when bent or twisted103,104. MXene overcomes these issues through its mechanical properties, processability, and thermal stability. Early reports of MXene-based chemiresistors focused on the detection of volatile organic compounds (VOCs) like acetone, ethanol, ammonia, and propanal using Ti3C2Tx95,96, which exhibited an S/N ratio more than two orders of magnitude higher than other 2D materials105 (-i). DFT simulations highlighted that the hydroxyl (-OH) surface group largely improves affinity to analytes through strong hydrogen-bonding interactions106. The specific mechanism for chemiresistive sensing in Ti3C2Tx is similar to that of p-type materials, where the adsorption of reducing gas molecules in defect sites and surface functional groups leads to an increase in resistance106,107 (-ii). Theoretical simulations suggested that introducing additional vacancies in Ti coordination could further enhance sensing performance by increasing the physical adsorption of analytes108. The findings from these pioneering studies, including the sensing mechanism of Ti3C2Tx, opened opportunities in developing similar technologies based on other MXene variants, such as V4C3Tx and V2CTx102,109. Interestingly, the vanadium (V)-based MXenes were found to respond to nonpolar gases as well. V2CTx-based gas sensors can detect hydrogen and methane with LODs of 2 and 25 ppm, respectively, at room temperature, ascribed to the high affinity of gases to the transition metal V102. Aside from typical VOCs, chemiresistive MXene-based sensors are also popular in humidity sensing due to MXene's hydrophilicity110,111,112,113.\nAchieving higher sensitivity with pristine MXene-based chemiresistive sensors encounters issues such as sheet restacking. For example, fabrication techniques like drop-casting or vacuum filtration can create dense MXene membranes and block active sites. This can be addressed by using porous architectures or modified 3D templates to enhance mass transport. Ti3C2Tx-coated porous nonwoven fabric gas sensor enhanced analyte diffusion and interaction with MXene, achieving a response 3.5 times greater than the as-prepared MXene at a fast rate (1.5 min) with low LOD (50 ppb)114.\nMXene can be hybridized with inorganic nanomaterials115,116 or organic fillers117 to increase active sites and/or reduce or modulate its electrical conductivity, enabling the measurement of smaller resistance changes. For instance, Ti3C2Tx/WSe2 heterostructure gas sensors exhibited higher sensitivity and faster recovery time than Ti3C2Tx after exposure to ethanol (1-40 ppm). Aside from the stark difference in performance, the two samples exhibited contrasting sensing mechanisms, with Ti3C2Tx as p-type and Ti3C2Tx/WSe2 as n-type sensors115. Control over band structures was used to improve selectivity between two gases, resolving the issue of indiscriminate sensing in chemiresistive sensors, using a Ti3C2Tx/WSe2 heterostructure107, whereby reducing and oxidizing gases produced opposite transient response curves (-iii). Hybrid materials can also enable the detection of species such as biomolecules. MXene-chitosan sensors fabricated via dip coating with chitosan are used as enzymatic biosensors. Chitosan and Ti3C2Tx served as a support matrix to immobilize cholesterol oxidase enzymes and enhance electrical conductivity117.\nCapacitive sensors\nMXene's hydrophilicity makes it ideal for capacitive humidity sensing, measuring capacitance changes due to changes in electrode distance or area. Although its potential for humidity sensing was implied in early reports111,118, pristine MXene suffers from poor selectivity and sensitivity119. This issue is remedied by employing semiconductors to design heterostructures and form Schottky barriers. The Ti3C2/TiO2-based humidity sensor was prepared by growing TiO2 nanowires on exposed Ti sites across the Ti3C2Tx structure, increasing the surface area and adsorption sites to enhance the sensor performance. Water adsorption increased carrier concentration and lowered the hole energy level barrier at the Ti3C2/TiO2 Schottky junction, increasing conductance and achieving high sensitivity (280 pF/RH%) even at low humidity120 (-i). Similarly, high surface area tin sulfide (SnS2) was decorated with Ti3C2Tx sheets to achieve a capacitance increase (sensitivity metric) of 433,827% from 7% to 93% RH at 1 kHz excitation frequency, compared to the 59,306% increase using just SnS2121. Apart from MXene-semiconductor heterostructures, using MXene with metal nanoparticles like silver (AgNPs) also improves charge mobility and sensitivity. Ti3C2Tx accommodates two layers of H2O molecules through H-bonding before succeeding layers are merely physisorbed and become mobile, with some molecules undergoing ionization and therefore acting as charge carriers. The presence of AgNPs decreases the energy barrier for the interaction of water molecules with the sensing layer. The synergy between Ti3C2Tx and AgNPs resulted in a 15-fold improvement in sensitivity in the composite sensor (106,800%) vs. Ti3C2Tx122. Furthermore, the interaction between the Ti3C2/Ag system can be improved through plasma treatment123.\nMXene's susceptibility to oxidation in aqueous and humid environments affects the integrity and reproducibility, requiring the addition of hydrophobic or antioxidative materials and other post-treatments. For example, a sodium ascorbate (SA)/MXene ink remained stable for printing flexible humidity sensors when stored for 30 days124 (-ii). The cross-linked Ti3C2Tx film with polyethyleneimine and glutaraldehyde also exhibited improved stability after long-term storage125.\nElectrochemical sensors\nElectrochemical sensors rely on redox-mediated charge transfer processes occurring between the material and the analyte to produce a current or potential that is proportional to the amount of analyte interacting with the recognition element 126. Depending on the technique (potentiometric, amperometric, or impedimetric), sensor design, and electrochemical activity of the analyte, the sensor responds to the analyte either directly or indirectly127. These variables play into the adaptability of electrochemical sensing, from material design to technique optimization, and open it up to a wide range of analytes from metal ions to pathogens128,129,130,131 while employing metal-organic frameworks132,133, enzymes134,135,136,137, aptamers138,139, and molecularly imprinted polymers140,141,142 as recognition elements. MXene's tunable composition, surface reactivity, high conductivity, and large surface area collectively benefit electrochemical sensors143,144. For example, the layered structure and surface chemistry of Ti3C2Tx are ideal for ion-selective electrodes (ISE) , and modification with certain chemical moieties improves selectivity126,145,146. Pristine MXene (Ti3C2Tx) was also found to improve peak separation and sensitivity in multicomponent sensing88. Aside from its chemical and electrical properties, architecture and morphology also play a crucial role in the performance of MXene-based electrochemical sensors by optimizing ion mobility within the structure. Controlling the porosity and sheet alignment facilitates the migration of analytes19,147 and even sensing elements like enzymes148 into the MXene structure.\nThe applicability of MXene-based electrochemical sensors is challenged primarily by oxidation in water, which limits their anodic potential windows in aqueous solutions149,150. Growing a poly(amidoamine) dendrimer improves the anodic stability of Ti3C2Tx151 , but the mechanism by which this occurs remains underexplored. Another relevant issue is the optimization of faradaic interactions between MXene and the analyte, especially at bulk configurations. Noriega et al. reported that thin MXene films composed of large sheets provide better S/N ratio, as opposed to thick films or films made from small sheets152.\nSheet restacking in electrochemical sensors also limits mass transport. Incorporating spacers with high analyte affinity increases interlayer spacing, creating more active sites for small organic molecules153,154. Incorporating MXenes into porous and 3D architectures can also help to further address this issue155. Kalasin et al. reported improved sensing efficiency by adding solid-contact sodium (Na+)-intercalated (sodiated) nanoporous carbon/polyethylene glycol and Ti3C2Tx layers to sodiated transducers composed of PEDOT:PSS for potentiometric Na+ sensing and polypyrrole for voltametric creatinine detection155 .\nOptical and spectroscopic sensors\nMXene-based optical sensors utilize plasmonic properties and tunable electronic structures to detect stimuli such as light, chemicals, and biomolecules, enabling efficient signal transduction through high conductivity and surface functional groups. MXenes enhance the sensitivity of optical sensors by facilitating strong light-matter interactions and supporting localized surface plasmon resonance (LSPR)156. Each type of sensor, along with its associated challenges, is discussed in this section with a comprehensive summary in .\nPlasmonic sensors\nSurface plasmon resonance (SPR) occurs when free electrons on a metal surface resonate with incident light. SPR sensors detect molecular interactions by measuring refractive index changes near a metal-dielectric interface. MXene offers significant advantages in SPR sensors due to its large lateral size, which enhances contact with metal layers and facilitates interaction with the sensing medium and electromagnetic fields. Its strong light absorption157 and low transmission loss158 improve sensor sensitivity and electric field enhancement near the sensing medium. MXene's optical transparency, stability, and tunable bandgap also enable high penetration depth and sensitivity159. Moreover, MXene's high surface area-to-volume ratio enhances the binding capacity of the metal layer for analytes, overcoming the limitations of traditional metal films. Its tunable surface chemistry further underscores its suitability for SPR-based biosensors160. It also protects the metal layer from oxidation by acting as a dielectric layer, further boosting sensitivity.\nMXene-based SPR sensors are typically fabricated so that incident light interacts with the sensor chip through a prism positioned beneath the sensor substrate. The two most commonly used prism configurations are the Kretschmann and the Otto configurations161. In the Kretschmann configuration, light passes through the prism and reflects off a thin metal layer coated on its surface, exciting surface plasmons at a specific resonance angle. In contrast, the Otto configuration features a small air gap between the prism and the metal layer, where surface plasmons are excited by an evanescent wave.\nTo overcome challenges such as limited penetration depth and sensitivity, advanced designs like a nearly guided wave SPR configuration have been introduced. The Otto setup offers greater durability under high-intensity light due to its superior thermal resistance and reduced wear on the metal layer. However, it is more complex to implement, as it requires precise control of the air gap.\nThe Kretschmann configuration, on the other hand, is simpler to set up and is therefore preferred for standard applications involving moderate light intensity162. MXene's exceptional mechanical and thermal stability163 makes it particularly well-suited for use in the Kretschmann configuration, further enhancing the performance and practicality of MXene-based SPR sensors.\nMulti-pronged factors, such as penetration depth, are crucial for SPR sensors, as they define how far the plasmonic (electric) field extends from the metal surface into the sensing region, determining the interaction range with the target material. In propagating SPR, however, the penetration depth is relatively limited164. To address this, researchers have explored various advanced SPR configurations, such as incorporating a thin high-index dielectric film between the metal and sensing layer, known as nearly guided wave SPR, which enhances sensitivity165.\nFor example, Wu et al. demonstrated an SPR biosensor enhanced with a few-layer Ti3C2Tx MXene, which improves sensitivity and acts as a protective layer on metal thin films. Sensitivity enhancements of up to 46.3% and a maximum of 224.5°/RIU demonstrate the potential use of MXene in advancing SPR biosensing technology166. Similarly, a functionalized MXene-based SPR sensor for early SARS-CoV-2 detection by immobilizing thiol-tethered ssDNA on the MXene layer, demonstrating high sensitivity and selectivity167.\nThe performance of the proposed SPR biosensor strongly depends on the number of Ti3C2Tx MXene layers. Increasing the layer count broadens the Au-based SPR curves due to electron energy loss and shifts the resonance angle through enhanced light absorption. Sensitivity improves significantly up to four MXene layers but tends to plateau beyond that, even when combined with other materials. For example, SPR sensors paired with gold, aluminum, and copper show limited sensitivity gains at λ = 633 nm, with enhancements of 28.4%, 46.3%, and 33.6% enhancements for 7, 12, and 9 MXene layers, respectively166.\nA theoretical study using finite difference time domain (FDTD) simulations examined MXene layer thickness ranging from 1 to 10 layers and found that thickness significantly affects sensor sensitivity. Notably, the effect varies with surface termination. F-terminated MXene achieved the highest sensitivity at 133.39°/RIU168.\nAlthough direct experimental research on surface terminations in SPR sensors is still lacking, surface terminations are known to influence MXene's electronic structure. For example, outermost halogen terminations like -I, and -Br can gain electrons and convert to their elemental forms when used as cathodes in Ti3C2I2 or Ti3C2Br2169. This electronic transformation impacts the plasmonic properties of MXene170,171. Future experimental studies are expected to further explore how surface terminations affect SPR sensor performance, offering deeper insights into optimizing these materials.\nSurface-enhanced Raman spectroscopic (SERS) sensors, another type of plasmonic sensor, amplify weak Raman scattering signals through surface-enhanced scattering. Since the first report of pristine Ti3C2Tx MXene as a SERS substrate in 2017172, numerous studies have explored its properties and applications. Researchers have examined the effects of MXene terminal groups173, layer thickness174, and crystallinity175 on SERS performance.\nFor instance, Ti3C2O2-terminated MXene demonstrates superior SERS activity compared to Ti3C2(OH)2 due to its ability to generate a stronger near-field effect. The layer thickness of Ti3C2Tx nanosheets also plays a crucial role, as Raman enhancement is highly thickness dependent. Studies have demonstrated that films thinner than 0.8 μm (for 532 nm) and 1.0 μm (for 633 nm) laser excitations provide strong enhancement for methylene blue detection. However, once the thickness exceeds 2.0 μm, the enhancement levels off, indicating a threshold beyond which additional layers no longer contribute significantly to the collective effect. Additionally, crystallinity is key to SERS performance. For instance, a highly crystalline monolayer Ti3C2Tx capable of maintaining its structure forms a nucleus-free 2D electron gas, enabling strong visible-range localized SPR (LSPR, defined as the SPR phenomenon exhibited in nano-regime) that enhances SERS sensitivity. Beyond studies of pristine MXene substrates, integrating MXenes with noble metals has emerged as a promising strategy for enhancing SERS performance176,177. This approach leverages the plasmonic properties of noble metals alongside the unique electronic properties of MXenes, resulting in highly sensitive and versatile SERS platforms.\nA prominent resonance around ~1.7 eV has become a key in understanding the signal enhancement mechanism, though its exact origin remains under investigation172178. In the case of Ti3C2Tx, the near-infrared absorption peak at ~1.7 eV (800 nm) has been attributed to a combination of interband transitions (IBT) and localized surface plasmon resonance (LSPR). Density functional theory (DFT) studies support the IBT hypothesis, highlighting the peak's sensitivity to surface terminations while showing it to be largely independent of particle size179 and solvent environment180.\nEvidence for LSPR contributions includes the detection of transverse plasmonic resonances via STEM-EELS178 and voltage-induced blueshifts in electrochromic devices181. Ongoing and future studies are expected to clarify the underlying mechanisms and facilitate the continued development of MXene-based SERS substrates.\nElectrochemiluminescent and photoluminescent sensors\nIn addition to plasmonic sensors, MXenes have also been investigated for their potential in luminescent sensing182. Luminescent sensors generate and separate charge carriers to produce an electrical signal upon light exposure. Due to high light absorption, efficient charge transport, and catalytic activity, MXenes have been employed as photoactive materials in these types of sensors to detect various analytes, such as heavy metals, organic pollutants, and biomolecules. In addition, MXenes have shown great promise as luminescent materials for biosensing, as their photoluminescence can be modulated through surface functionalization and interactions with target analytes. For instance, Ti3C2 MXene quantum dots detect metal ions and small molecules based on their photoluminescence quenching or enhancement effects183.\nHowever, MXenes also face challenges in photoluminescent sensing, such as weak photoluminescence efficiency, which limits sensitivity, and instability due to surface defects, oxidation, and degradation in aqueous environments. This issue can be addressed by doping MXene Quantum dots (MQDs) with metal or non-metal elements, like nitrogen, sulfur, or transition metals (e.g., Mn and Cu), to alter their electronic properties and introduce new energy levels, thereby improving photoluminescent efficiency. For instance, a Cu ion sensor was developed using nitrogen-doped MQDs (N-MQDs), where PL quenching depended on Cu ion concentration184. Another sensor, made with nitrogen and phosphorus-doped MQDs, showed enhanced quenching and a low LOD for Cu ions. MQDs can also be detected in ions such as Fe and Cd185.\nTi3C2Tx is highly promising for fluorescence detection due to its excellent performance in fluorescence resonance energy transfer (FRET), serving as an effective energy acceptor and fluorescence quencher, making it ideal for MXene-based fluorescent aptasensors186. For instance, a Ti3C2Tx MXene-based FRET aptasensor was demonstrated for thrombin detection using fluorescein amidite-labeled aptamers. The aptamers bind to Ti3C2Tx, enabling fluorescence quenching via FRET, demonstrating high sensitivity, specificity, and potential for clinical and bioactive molecule detection187. Other MXenes, such as FL-V2CTx and ML-V2CTx, have been explored for fluorescence sensors188. Few-layered MXenes offer improved adsorption and desorption capabilities due to their larger surface area, while multi-layered MXenes may face limitations, such as weaker fluorescence. However, the differences in performance between few- and multi-layered MXenes highlight the need for further investigation to optimize their use in fluorescence-based sensing applications. Although MXene-based aptasensors are promising, they remain in the early stages. Challenges such as short aptamer half-lives and a lack of diverse aptamers highlight the need for developing innovative strategies in future research186.\nUnlocking potential: exploring opportunities in unresolved challenges\nThe literature highlights efforts to address challenges in MXene-based sensors, yet unresolved barriers persist, which are discussed in this section .\nA standardized method of producing MXenes\nReviews on MXenes consistently emphasize that differences in synthesis methods and precursors result in variations in MXene properties189,190,191. MXenes etched with 50% HF or LiF/HCl exhibited different surface compositions, impacting their dispersibility192. Post-synthetic processes, including drying, can cause MXene to restack, altering its behavior. A solvent exchange technique could bypass drying for MXenes, enabling solution processing of MXene-based fiber composites193. These studies highlight how surface composition variations from different etching methods influence MXene performance in various solvent environments. Therefore, further research is needed to achieve uniform surface terminations and device architectures for specific sensing applications. Currently, surface modifications like covalent or noncovalent interactions with large molecules194,195, surfactants196, or polymers35 are performed. These modifications are customized for specific techniques that require tailored surface properties and solvent interactions.\nCost-effective, scalable and sustainable production of MXenes\nTo make MXene-based sensors commercially viable, production must become more cost-effective and scalable without compromising performance. However, producing high-quality MXenes with consistent structural, chemical, and electrical properties at scale remains technically challenging and resource-intensive. Conventional methods, such as selective etching using hydrofluoric acid or in-situ HF generation, rely on hazardous chemicals, require precise reaction control, and generate significant chemical waste. These issues raise safety, environmental, and cost concerns.\nTo overcome these limitations, research is shifting toward more sustainable and economical strategies. One promising approach involves repurposing carbon-rich industrial byproducts or biomass to produce MAX phase precursors197. This approach not only reduces raw material costs but also aligns with circular economy goals by turning waste into valuable feedstock. At the same time, synthesis techniques are being optimized for large-scale production. Chemical vapor deposition (CVD), particularly with titanium tetrachloride (TiCl4), a low-cost manufacturing precursor, offers a scalable, cleaner alternative to etching. CVD enables the direct synthesis of Cl-terminated MXenes, which show greater structural stability and oxidation resistance than conventional -OH, -O, or -F terminated MXenes from wet-etching methods198.\nVapor-phase growth methods like CVD offer enhanced control over film thickness, crystallinity, and uniformity, which are parameters critical for device integration and reproducibility. CVD allows for precise engineering of surface terminations, opening new opportunities for tailoring MXene properties for specific sensing applications.\nLife cycle assessments (LCAs) further support the need for synthesis optimization. Recent studies highlight that electricity consumption during production is a major contributor to environmental impact199. By simplifying synthesis, eliminating hazardous chemicals, and integrating process cost analysis, the overall sustainability and scalability of MXene production can be significantly improved.\nAs demand grows for flexible and wearable electronics, adopting scalable and environmentally sustainable methods like CVD becomes increasingly important. When combined with the use of industrial waste streams and streamlined synthesis protocols, these strategies represent a key step toward realizing the large-scale, reliable manufacturing of MXene-based sensors and devices.\nAddressing MXene stability issues\nMXenes are known to undergo surface degradation when exposed to water, resulting in the formation of oxide layers that compromise their electrical conductivity and overall performance200. Additionally, prolonged exposure to such conditions can lead to the loss of essential surface terminations, which are critical for their functionality. In practical device applications, MXene-based sensors are particularly vulnerable to harsh environmental conditions such as human sweat, body heat, and friction-induced mechanical stress201. Sweat, which contains water, salts, and various biomolecules, creates an electrolyte-rich environment that promotes the electrochemical oxidation of MXenes. Elevated temperatures from body heat further accelerate this degradation process. As oxidation progresses, surface oxides form, reducing the electrical conductivity and sensing capabilities of the material.\nMechanical stress from continuous movement, bending, and skin contact introduces shear forces that can lead to microcracks, delamination, or abrasion of protective coatings. These mechanical damages expose fresh MXene surfaces to ambient oxygen and moisture, which are highly reactive and prone to rapid oxidation. This results in a recurring degradation cycle. The combined effects of chemical exposure from sweat and mechanical wear are well-established contributors to the accelerated deterioration of MXene-based sensors149, ultimately leading to reduced signal stability, increased noise, and diminished sensitivity and durability, thus limiting the long-term usability of wearable devices.\nTo enhance MXene stability, surface passivation and protective coatings such as polymers, self-assembled monolayers, or inorganic layers are commonly employed. While these approaches have shown short-term effectiveness, their long-term performance under real-world conditions remains uncertain due to a lack of extended experimental data202,203,204. Over time, passivation layers can degrade through mechanical abrasion, delamination, or the infiltration of oxygen and water molecules via microscopic defects or diffusion pathways. Once compromised, these layers expose the underlying MXene, restarting the degradation process.\nTherefore, ensuring long-term reliability of MXene-based sensors requires further research into robust encapsulation strategies and implementation of realistic aging protocols. These efforts are essential to fully understand and address the time-dependent failure mechanisms of passivated MXene-based sensors in practical environments.\nLarge-scale integration and real-world testing\nIntegrating MXenes into devices while retaining their unique properties remains challenging. Key obstacles include achieving uniformity, ensuring compatibility with diverse substrates, and enabling scalable, efficient fabrication205. Despite notable progress, most studies remain confined to controlled laboratory environments that do not reflect real-world conditions.\nTo move MXene-based sensors toward commercial use, rigorous testing under diverse environmental conditions is essential. Scalability will depend on standardized protocols for material selection, device fabrication, and performance metrics like sensitivity, response time, and detection limits. Long-term reliability, mechanical durability, calibration consistency, and quality control are also critical to ensure manufacturability and real-world functionality.\nStart-ups will play a key role in bridging the gap between research and commercialization. Their agility allows them to focus on targeted applications, refine production methods, and respond quickly to market demands. By fostering innovation across cross-sector collaboration, start-ups can accelerate product development and reduce the risks associated with early-stage technology.\nThis is particularly valuable in fast-moving fields of wearable electronics and smart systems, where user needs and supply chains are still evolving. With growing investment and interdisciplinary cooperation, start-ups are poised to drive the adoption of MXene-based sensors in next-generation intelligent and flexible technologies.\nPotential use of artificial intelligence in design and testing\nThe rapid advancement of artificial intelligence (AI) offers great potential for enhancing MXene-based sensors, driving improvements in design, optimization, and overall performance. AI can serve as a tool for refining key aspects of fabrication, such as material density, surface uniformity, and electrode placement, ensuring consistency and preserving signal integrity. Through AI-driven design and modeling, complex interactions between sensor components can be analyzed, leading to more efficient, reliable, and cost-effective sensor development. Furthermore, AI's ability to process large datasets allows for the identification of hidden patterns, relationships, and anomalies during fabrication and testing. This optimization can enable continuous, real-time data analysis, supporting personalized and highly responsive monitoring. Integrating AI with MXene sensor research could expand their capabilities, offering dynamic, accessible, and impactful solutions for environmental monitoring, healthcare, and many other applications.\nHowever, it is important to emphasize that the success of AI models heavily depends on the quality and reliability of the underlying sensor data. If sensor systems are not stable or consistent over time, they can produce noisy, incomplete, or inaccurate datasets. Such compromised data will negatively impact the training process of AI algorithms, leading to models that perform poorly when applied to real-world conditions. This limitation can reduce the predictive accuracy, generalizability, and robustness of AI-driven solutions, ultimately hindering their practical utility. Therefore, ensuring the development of reliable, durable, and high-quality MXene sensors is a critical prerequisite for effective AI integration. Without this foundation, the benefits of AI in improving sensor performance, scalability, and application-specific customization will be significantly diminished, underscoring the need for continued research focused on sensor stability and reproducibility.\nSummary and conclusion\nSubstantial progress has been made in advancing MXene-based sensors, setting the stage for their potential commercialization. Nonetheless, industrial-scale production and application still face significant obstacles. Although Ti3C2Tx MXenes are highly responsive active materials for physical sensors (e.g., strain and pressure), they are primarily limited by mechanical stability. Fortunately, their compatibility with polymers and their ability to form films, fibers, or aerogels allows for versatile sensor designs. Integrating MXenes into 3D structures enhances mechanical properties, increases surface area, and improves sensitivity to dynamic loading and deformation. Improved coating techniques for enhanced substrate compatibility help mitigate issues like delamination and damage during repeated physical processes, further enhancing durability and functionality. On the other hand, MXenes face challenges in force-sensitive sensing applications like acoustic, temperature, and photoresponsive detection due to excessive conductivity. Hybrid nanomaterial structures are addressing these issues by enhancing performance and adding functionalities beyond the intrinsic capabilities of MXenes. Meanwhile, chemical and electrochemical sensors based on MXenes often struggle with limited mass transport to active sites due to their tendency to layer and restack. Additionally, MXenes' susceptibility to oxidation compromises performance in chemical environments. Active materials and interlayer spacers are integrated into MXenes to improve mass transport, prevent oxidation, and reduce issues with conductivity and capacitive behavior, thus enhancing analyte signal detection. Optical and spectroscopic sensors relying on MXenes' electromagnetic properties require highly uniform chemical structures and surfaces. Strategies such as surface modifications and composite materials can be employed to address this. However, the interfacial interactions between MXenes and functional materials, as well as the fundamental issues in MXene-based optical sensors, require further investigation and remain a complex area of ongoing research. Moreover, the commercialization of MXene-based sensors is hindered by costly, hazardous synthesis, stability issues like oxidation, and scalability challenges. The lack of real-world testing in existing studies also poses a challenge. Overall, tackling these issues is expected to accelerate the development of next-generation MXene-based sensors."
  }
]